MicrochipTech/dspic33a-high-speed-adc-example/capture.c
/*
 * capture.c
 *
 * The measurement of the ADC/DMA example: the ADC result streams through
 * DMA channel 0 (dma.c) into a double buffer; the channel's events are
 * handled here - every error the hardware can report is counted and the
 * burst is restarted - plus the start/stop/input control the console
 * uses, the self-test on the internal reference and the per-half
 * processing with the LED heartbeat.
 *
 * Data path
 *   The ADC channel runs in Integration mode: a software trigger starts a
 *   burst, the back-to-back trigger keeps it going for CNT conversions,
 *   and each conversion raises the "ADCn Done CH0" event that triggers
 *   the DMA. The DMA copies the 12-bit result from ADnCH0RES into one
 *   buffer of two halves; its HALF and DONE flags tell the CPU which half
 *   is complete. At DONE the ISR starts the next burst.
 *
 *   Why not "single conversion + immediate re-trigger": the datasheet
 *   states that TRG2SRC is not used in Single Conversion mode (p1322) and
 *   lists the back-to-back value as reserved for TRG1SRC (Table 16-3,
 *   p1226). Free-running conversion exists only in the multisample modes,
 *   and there it is bounded by CNT (max 65535), so the burst has to be
 *   restarted. Tying CNT to the DMA buffer keeps ADC and DMA in step -
 *   and is why the burst restart sits in the DMA interrupt, not in adc.c.
 *
 * Self-test
 *   Before the external input is used, the same chain samples the ADC's
 *   internal 15/16 * VDD reference (ADxAN6, DS70005591D Table 16-2) and
 *   checks that the mean of a buffer half is where it must be (~3840).
 *   That proves clock, ADC, DMA and ISR together without a signal source.
 *
 * Every register write below cites the datasheet table or page it comes
 * from. What has and has not run on the board: docs/HARDWARE-LOG.md.
 */

#include <xc.h>
#include <stddef.h>
#include "board.h"
#include "adc.h"
#include "dma.h"
#include "capture.h"
#include "led.h"
#include "console.h"
#include "diag.h"
#include "sim.h"
#include "timebase.h"
#include "clock.h"
#include "sccp.h"

/* Self-test input and window. ADxAN6 is the internal 15/16 * VDD
 * reference on every core and package (Table 16-2, p1224), which the
 * datasheet itself samples for gain calibration (Example 16-3, p1328) -
 * with SAMC = 3, because an internal reference is not a 50 ohm source.
 * Expected mean: 15/16 * 4096 = 3840; the window allows +-5 %. */
#define SELFTEST_PINSEL   6u
#define SELFTEST_SAMC     3u      /* 6.5 TAD = 81 ns, as in Example 16-3 */
#define SELFTEST_HALVES   6u      /* halves to let the switch settle    */
#define SELFTEST_MIN      3648u   /* 3840 - 5 %                          */
#define SELFTEST_MAX      4032u   /* 3840 + 5 %                          */

/* Heartbeat: LED toggles every N completed halves. 39 062 halves per
 * second, so 19 531 gives a 1 Hz blink, 3 906 a 5 Hz blink. */
#define HEARTBEAT_OK      19531u
#define HEARTBEAT_ERR     3906u

/* ------------------------------------------------------------------ *
 * Sample buffer
 *
 * One buffer, two halves. 16-bit words because the DMA is configured for
 * 16-bit transfers (SIZE = 1) and the 12-bit result in ADxCH0RES[11:0]
 * fits. Aligned to 4 bytes: the DMA writes through a 32-bit path and
 * unaligned buffers are asking for trouble.
 * ------------------------------------------------------------------ */
/* Guard words directly behind the buffer, in the same struct so that the
 * linker cannot put anything between. capture_init() fills them with a
 * pattern, capture_service() and the self-test check them: if the DMA
 * writes one transaction past the buffer - wrong SIZE encoding, wrong
 * CNT semantics, wrong DAMODE - this is the first memory it hits, and
 * the run stops in fail(11) with the words printed instead of dying
 * somewhere in the variables or the stack that follow. */
#define BUF_GUARD_WORDS       16u
#define BUF_GUARD_PATTERN(i)  (0xA5C3F00Du + (i))

/* THE DMA BUFFER - a dedicated object, and nothing else is in it.
 *
 *   volatile   the DMA writes it behind the compiler's back; every read
 *              must go to memory, never to a cached register value
 *   section    its own section ".dma_buffer", so the linker keeps it in
 *              one piece and no other variable is laid out inside or
 *              across it (see the map file)
 *   aligned    4 bytes, the DMA writes through a 32-bit path
 *   window     dma0_init() sets DMALOW/DMAHIGH to exactly this object:
 *              the hardware refuses any DMA transaction outside it
 *   guard      the words behind the samples are the software check of
 *              the same thing (fail 11)
 *
 * So a DMA transfer cannot collide with the rest of memory: not by
 * layout, not by the hardware, and if it somehow did, not unnoticed. */
static volatile struct {
    uint16_t data[SAMPLES_PER_BUF_MAX];
    uint32_t guard[BUF_GUARD_WORDS];
} dma_buffer __attribute__((section(".dma_buffer"), aligned(4)));
#define buf (dma_buffer.data)

/* ------------------------------------------------------------------ *
 * Measurement counters - the actual point of this program
 *
 * Read these with the debugger or the "status" command. dma_overrun is
 * the number that answers "does the bus keep up": the datasheet documents
 * a single shared DMA data bus (DS70005591D 13.4.4, p825) but gives no
 * throughput figure.
 * ------------------------------------------------------------------ */
volatile uint32_t blocks_done   = 0;   /* completed buffer halves          */
volatile uint32_t dma_overrun   = 0;   /* DMA0STAT.OVERRUN seen            */
volatile uint32_t dma_addr_err  = 0;   /* DMA0STAT.ADRERR != 0             */
volatile uint32_t dma_bus_err   = 0;   /* DMA0STAT.BRERR | BWERR (note 1)  */
volatile uint32_t late_service  = 0;   /* HALF and DONE pending together   */
volatile uint32_t proc_missed   = 0;   /* main() skipped a completed half  */
volatile uint16_t last_sample   = 0;   /* sanity check: is data moving?    */
volatile uint32_t ready_half    = 0;   /* 0 = buf[0..], 1 = buf[1024..]    */
volatile uint32_t selftest_mean = 0;   /* mean seen on ADxAN6, ~3840       */
volatile int32_t  proc_result   = 0;   /* output of process_buffer()       */

/* Three counters that exist for one question, raised by run 14: the
 * sweep reported overruns at 4 MSPS, where the DMA has eight times the
 * headroom it needs, and its loaded rate column read ten times the rate
 * a clean burst measures at the same setting. Two explanations fit and
 * they need separating.
 *
 *   (a) one conversion produces several DMA transfers. Microchip
 *       acknowledges exactly that for this silicon: "ADC triggers for DMA
 *       on this device have an issue. A few transfers are possible per
 *       one trigger."
 *   (b) the handler books the same HALF or DONE more than once, because
 *       the status flag did not clear and every later entry - and at full
 *       rate there are 1.6 million of them a second, one per overrun -
 *       sees it again. That would be our bug, and fixable.
 *
 * The three numbers tell them apart. If half_events is of the order of
 * the overrun count, the flags are not clearing: (b). If they stay at one
 * per 1024 transfers while the counts still race, the transfers really
 * are happening: (a). */
volatile uint32_t isr_entries   = 0;   /* calls of dma0_event()            */
volatile uint32_t half_events   = 0;   /* HALF seen set                    */
volatile uint32_t done_events   = 0;   /* DONE seen set                    */
/* The one that decides it. One burst is CNT = 2 * half_len conversions,
 * which is exactly one buffer: HALF in the middle, DONE at the end. So in
 * back-to-back streaming blocks_done MUST be exactly twice the number of
 * bursts started - that is arithmetic, not an assumption about the
 * silicon. If it is ten times that, the handler is booking the same event
 * over and over and the fault is ours. If it holds while the rate still
 * races, the transfers really are happening and it is the trigger defect
 * Microchip acknowledges. Note that half_events + done_events == blocks
 * by construction and therefore proves nothing on its own. */
volatile uint32_t burst_starts  = 0;   /* calls of start_burst()           */

/* Note 1: errata DS80001162E item 2 - BRERR is only set when RETEN = 1,
 * and RETEN also raises a trap. This example leaves RETEN = 0, so
 * dma_bus_err effectively counts write errors (BWERR) only. */

/* Run control. run_enabled is what the console sets; burst_active says
 * whether a burst is in flight, so that "start" during a burst does not
 * trigger a second one on top. */
static volatile bool    run_enabled  = false;
static volatile bool    burst_active = false;
static volatile bool    powered      = true;    /* ADC core + CLKGEN6 on */
static volatile bool    dma_armed    = false;   /* dma0_init() done, not deinit */
static volatile uint32_t half_len    = SAMPLES_PER_HALF_MAX;   /* in use  */

/* Channel reconfiguration requested by the console or the self-test,
 * applied by the ISR between two bursts, when the channel is idle. */
static volatile bool    switch_pending = false;
static volatile uint8_t pinsel_next    = ADC_PINSEL;
static volatile uint8_t samc_next      = ADC_SAMC;
/* The ADC clock divide ratio in hundredths, as last set successfully.
 * The hardware's own answer is clock_adc_div(); this is what was asked
 * for, so that a switch that did not arrive can be told from one that
 * did (capture_clkdiv_wanted vs capture_clkdiv). */
static uint32_t          clkdiv_cur     = ADC_CLKDIV;

/* Emergency brake against the overrun interrupt storm.
 *
 * At the undivided rate the DMA loses about 4 % of the samples, and
 * every lost sample raises the channel interrupt: 1.6 million per
 * second, one every 625 ns, which is 125 CPU cycles at 200 MHz. An
 * interrupt entry with its context save plus this handler costs about
 * as much, so the CPU sits exactly on the edge of never returning to
 * the main loop - and twice it fell off: run 7 stopped in the DAC test,
 * run 8 in the sweep, both silently, both with the console dead (U2RX
 * is priority 1, the DMA channel 4). There is no enable bit for the
 * overrun event on its own (13.6.1; DMA0CH has HALFEN, DONEEN and
 * MATCHEN only), so it cannot be masked away.
 *
 * The handler is the only code still running when that happens, so the
 * handler is what stops it: past OVERRUN_LIMIT in one measurement it
 * masks its own interrupt, takes the channel down and ends the stream.
 * The rate is then reported as unusable instead of the board going
 * quiet. The limit is well above what a healthy full-rate point
 * produces (about 82 000 per 2000 halves, run 8) and is reached within
 * a third of a second once the storm runs away. counters_clear(), which
 * every test calls first, re-arms it. */
#define OVERRUN_LIMIT     500000u
static volatile bool     overrun_abort  = false;
/* The brake counts for itself, from zero at every capture_start().
 * It must not use dma_overrun: that one is the measurement and only
 * counters_clear() resets it, so after the brake had fired once the
 * very first overrun of every later test tripped it again and every
 * test reported "DMA channel disabled" (run 9). */
static volatile uint32_t overrun_run    = 0;
/* One burst and then stop, decided in the ISR (capture_oneshot). */
static volatile uint32_t oneshot_left   = 0u;  /* bursts still to run */
static volatile uint32_t oneshot_ticks  = 0;   /* of the burst alone */

/* The triggered stream of the chain test (capture_chain_start): SCCP1
 * paces the ADC in Single Conversion mode, the DMA runs on by itself, and
 * DONE restarts nothing - there is no burst. chain_stop_after counts DONE
 * events down to an automatic stop from the ISR (0 = run until told).
 * chain_t0/t1 are Timer1 at the SCCP1 start and stop, the window the
 * expected number of triggers is computed from. */
static volatile bool     chain_mode       = false;
static volatile uint32_t chain_stop_after = 0u;
static volatile uint32_t chain_t0         = 0u;
static volatile uint32_t chain_t1         = 0u;
static bool              chain_src_data   = false;  /* DMA from CH0DATA  */

