MicrochipTech/dspic33a-high-speed-adc-example/capture.c
/* What the processing of a half costs, in Timer1 ticks (80 ns): the
 * budget question of the example's sentence ("the CPU processes"). */
volatile uint32_t proc_ticks_max = 0;
volatile uint32_t proc_ticks_sum = 0;
volatile uint32_t proc_count     = 0;

/* capture.h: the defined idle state every test starts from. */
bool capture_settle(void)
{
    const bool was_running = run_enabled;
    capture_stop();
    if (chain_mode) {
        /* Triggered stream: the trigger goes first (ANALYSIS.md C.10
         * point 4), then nothing converts any more and nothing is in
         * flight to wait for. */
        sccp1_stop();
        if (chain_t1 == 0u) { chain_t1 = timebase_ticks(); }
        burst_active = false;
        chain_mode   = false;
    }
    /* The burst in flight ends at a block boundary by itself - at most
     * one buffer, 52 us at 40 MSPS. One that never ends (no clock, no
     * trigger) is aborted: core down and up. */
    uint32_t n = WAIT_LIMIT;
    while (burst_active && (--n != 0u)) { SIM_DMA_TICK(); }
    if (burst_active) {
        if (powered) { adc_deinit(); (void)adc_reinit(); }
        burst_active = false;
    }
    if (powered) { adc_clear_events(); }
    dma0_deinit();                    /* channel down; capture_start() */
    dma_armed  = false;               /* re-initialises it from scratch */
    ready_half = 0u;
    return was_running;
}
static bool quiesce(void) { return capture_settle(); }

static uint32_t         seen_blocks    = 0;

/* A burst is in flight from here until the DMA DONE interrupt. */
static void start_burst(void)
{
    burst_starts++;
    burst_active = true;
    {
        adc_start_burst();
    }
}

/* ------------------------------------------------------------------ *
 * Set-up: the DMA channel, wired to this ADC core and this buffer
 * ------------------------------------------------------------------ */
/* The guard words sit right behind the region in use: the struct's own
 * guard when the whole array is used, otherwise the words of the array
 * that follow the used region (a DMA writing one transaction too many
 * hits them first either way). 16 words = 8 samples' worth of 32-bit
 * words = 32 samples; the minimum half length keeps room for them. */
static volatile uint32_t *guard_word(uint32_t i)
{
    const uint32_t used = 2u * half_len;
    if (used + 2u * BUF_GUARD_WORDS <= SAMPLES_PER_BUF_MAX) {
        return (volatile uint32_t *)&dma_buffer.data[used] + i;
    }
    return &dma_buffer.guard[i];
}

void capture_init(void)
{
    for (uint32_t i = 0; i < BUF_GUARD_WORDS; i++) {
        dma_buffer.guard[i] = BUF_GUARD_PATTERN(i);
        *guard_word(i)      = BUF_GUARD_PATTERN(i);
    }
    /* Burst length and DMA block are the same number, set here from the
     * length in use: 2 * half_len conversions per burst, 2 * half_len
     * transactions per block, both re-done before every start. */
    adc_set_burst_len(2u * half_len);
    dma0_init(adc_dma_trigger(),
              chain_src_data ? adc_dma_source_data() : adc_dma_source(),
              dma_buffer.data, 2u * half_len * sizeof(uint16_t));
    dma_armed = true;
}
_Static_assert(sizeof dma_buffer.data == SAMPLES_PER_BUF_MAX * sizeof(uint16_t),
               "buffer allocation and its maximum must be the same thing");

uint32_t capture_half_len(void) { return half_len; }

bool capture_set_half_len(uint32_t n)
{
    if ((n < SAMPLES_PER_HALF_MIN) || (n > SAMPLES_PER_HALF_MAX)) { return false; }
    if (run_enabled || burst_active) { return false; }      /* stop first */
    (void)capture_settle();           /* DMA down; the next start re-inits */
    half_len = n;
    return true;
}

/* The same check without stopping, for a test that reports it. */
bool capture_guard_ok(void)
{
    for (uint32_t i = 0; i < BUF_GUARD_WORDS; i++) {
        if (*guard_word(i) != BUF_GUARD_PATTERN(i)) { return false; }
    }
    return true;
}

/* Stop with code 11 if anything wrote past the end of the buffer. */
static void guard_check(void)
{
    for (uint32_t i = 0; i < BUF_GUARD_WORDS; i++) {
        if (*guard_word(i) != BUF_GUARD_PATTERN(i)) {
            console_kv("[guard] word behind the buffer changed, index", i);
            console_kv_hex("[guard] value", *guard_word(i));
            console_kv_hex("[guard] expected", BUF_GUARD_PATTERN(i));
            fail(11u);
        }
    }
}

/* Switch the stream off hard, so that a 40 MSPS stream does not keep
 * hammering the bus while fail() or a trap handler prints. */
void capture_halt(void)
{
    dma0_halt();
}

/* ------------------------------------------------------------------ *
 * DMA event - one per buffer half, called from the DMA0 interrupt
 *
 * HALF: the first half is complete, the DMA is filling the second.
 * DONE: the second half is complete, the DMA has reloaded to the start
 *       and the ADC burst has ended - apply a pending input change and,
 *       if the stream is enabled, start the next burst here.
 *
 * Runs in the interrupt, priority 4 (IPC9 default). The console's UART
 * receive interrupt runs at priority 1, so this preempts a running
 * command.
 *
 * Deliberately short. Everything this counts is a hardware flag, so a
 * long handler would itself become the reason for the next overrun.
 * ------------------------------------------------------------------ */
void dma0_event(uint32_t st)
{
    isr_entries++;
    if (st & DMA0_OVERRUN) {
        /* Triggered while the previous transfer was still in progress
         * (p816): the bus did not keep up. This is the measurement. */
        dma_overrun++;
        overrun_run++;
        dma0_clear(DMA0_OVERRUN);
        if (overrun_run >= OVERRUN_LIMIT) {
            /* The brake (see OVERRUN_LIMIT above). Masking the interrupt
             * and disabling the channel here, from inside the storm, is
             * what gives the main loop the CPU back. */
            dma0_halt();              /* IEC2.DMA0IE = 0, CHEN = 0      */
            run_enabled   = false;
            burst_active  = false;
            dma_armed     = false;    /* the next start re-initialises   */
            overrun_abort = true;
            return;
        }
    }
    if (st & DMA0_ADRERR) {
        dma_addr_err++;
        dma0_clear(DMA0_ADRERR);
    }
    if (st & (DMA0_BRERR | DMA0_BWERR)) {
        dma_bus_err++;
        dma0_clear(DMA0_BRERR | DMA0_BWERR);
    }

    /* Both halves pending at once means this handler arrived more than
     * one half (25.6 us) late and the first half has already been
     * overwritten by the DMA reload. */
    if ((st & DMA0_HALF) && (st & DMA0_DONE)) {
        late_service++;
    }

