MicrochipTech/dspic33a-high-speed-adc-example/capture.c
    if (st & DMA0_HALF) {
        half_events++;
        dma0_clear(DMA0_HALF);
        ready_half  = 0u;
        last_sample = buf[half_len - 1u];
        blocks_done++;
    }
    if (st & DMA0_DONE) {
        done_events++;
        dma0_clear(DMA0_DONE);
        ready_half  = 1u;
        last_sample = buf[2u * half_len - 1u];
        blocks_done++;

        /* The channel is idle between bursts: this is the only safe
         * moment to change its input or sample time. */
        if (switch_pending) {
            adc_set_input(pinsel_next, samc_next);
            switch_pending = false;
        }
        if (chain_mode) {
            /* Triggered stream: the DMA has reloaded by itself and the
             * next trigger continues at buf[0]. Nothing to restart - only
             * the optional stop after a number of blocks, taken here so
             * that the buffer holds exactly the last block, contiguous and
             * no longer written. The trigger goes off first. */
            if ((chain_stop_after != 0u) && (--chain_stop_after == 0u)) {
                sccp1_stop();
                chain_t1     = timebase_ticks();
                run_enabled  = false;
                burst_active = false;
            }
        } else if (oneshot_left != 0u) {
            /* One buffer and no more, decided here rather than by the
             * main loop: at the full rate the main loop can be tens of
             * milliseconds behind, and by the time it asked for a stop
             * the buffer would have been overwritten a thousand times
             * over. Stopping from the ISR leaves exactly the 2 * half_len
             * samples of this burst standing, contiguous and unmolested. */
            /* One burst less to go. Only the last one ends the run;
             * the others restart immediately, exactly as continuous
             * streaming does - which is the point of measuring more than
             * one (run 16). */
            oneshot_left--;
            if (oneshot_left != 0u) {
                start_burst();
            } else {
                run_enabled  = false;
                burst_active = false;
            }
        } else if (run_enabled) {
            start_burst();            /* next 2 * half_len samples      */
        } else {
            burst_active = false;
        }
    }
}

/* ------------------------------------------------------------------ *
 * Control API (capture.h)
 * ------------------------------------------------------------------ */
void capture_start(void)
{
    if (!powered) {
        /* After capture_shutdown(): clock first, then the core - the boot
         * order. Registers kept their values, so the divide ratio is
         * what they were. A wait that runs out is reported and the
         * start refused; the counters show nothing moving. */
        const bool clk = clock_adc_on();
        const bool adc = adc_reinit();
        if (!clk || !adc) {
            console_puts(clk ? "[capture] ADC core did not come back (ADRDY)\r\n"
                             : "[capture] CLKGEN6 did not come back (CLKRDY)\r\n");
            return;
        }
        powered = true;
    }
    if (!dma_armed) {
        capture_init();               /* fresh DMA set-up for this run  */
    }
    overrun_run = 0u;                 /* the brake counts per run       */
    overrun_abort = false;
    run_enabled = true;
    if (!burst_active) {
        start_burst();
    }
}

void capture_shutdown(void)
{
    (void)quiesce();                  /* stream off, burst finished     */
    adc_deinit();
    clock_adc_off();
    powered = false;
}

bool capture_powered(void)
{
    return powered;
}

bool capture_select_core(uint8_t core, uint8_t pinsel, uint8_t samc)
{
    if ((core < 1u) || (core > 5u)) { return false; }
    (void)quiesce();
    if (powered) { adc_deinit(); }
    else         { (void)clock_adc_on(); }   /* the new core needs its clock */
    (void)adc_select(core);
    adc_init(pinsel, samc);                  /* core on, ADRDY, or fail(5) */
    capture_init();                          /* DMA on this core's trigger */
    switch_pending = false;
    pinsel_next    = pinsel;
    samc_next      = samc;
    powered        = true;
    burst_active   = false;
    counters_clear();
    return true;
}

void capture_stop(void)
{
    run_enabled = false;
}

bool capture_running(void)
{
    return run_enabled;
}

bool capture_overrun_aborted(void)
{
    return overrun_abort;
}

bool capture_burst_active(void)
{
    return burst_active;
}

bool capture_set_input(uint8_t pinsel, uint8_t samc)
{
    if ((pinsel > 15u) || (samc > 31u)) {
        return false;
    }
    pinsel_next = pinsel;
    samc_next   = samc;
    switch_pending = true;
    if (!burst_active) {
        /* Nothing running: apply right away, the channel is idle. */
        adc_set_input(pinsel, samc);
        switch_pending = false;
    }
    return true;
}

uint8_t capture_pinsel(void) { return adc_pinsel(); }
uint8_t capture_samc(void)   { return adc_samc(); }

/* ------------------------------------------------------------------ *
 * The ADC clock - the only rate control there is (capture.h)
 *
 * The conversions run back-to-back, so the sample rate is the ADC clock
 * divided by the eight clocks one conversion takes: 320 MHz undivided =
 * 40 MSPS. CLKGEN6's divider is therefore the rate knob, and the ladder
 * below is walked from the slowest rate to the fastest on purpose. The
 * slowest point is the one the DMA should manage comfortably, so the
 * first row of a sweep is the row most likely to pass - and a failure
 * there means the chain is broken, not the rate.
 *
 * Integer and fractional ratios alternate deliberately. 2.5 sits exactly
 * between 2 and 3, and 4.5 between 4 and 5: if those rows land halfway
 * between their neighbours, FRACDIV works; if they snap to a neighbour,
 * the fractional field is ignored and only INTDIV counts. Nothing else
 * in the log answers that question.
 *
 * There is a gap between 20 and 40 MSPS and it is not an oversight: the
 * datasheet says FRACDIV does nothing while INTDIV is 0 (12.4.2 4b),
 * so no ratio between 1 and 2 can be realised at all. 20 MSPS is the
 * fastest divided rate; the next step up is the undivided clock.
 *
 * 500 = 8 MSPS is the rate the customer's application needs; it is in
 * the ladder for that reason and for no other.
 * ------------------------------------------------------------------ */
/* The rate ladder, slowest first. Each row is a pair of PLL1 output
 * dividers; the ADC clock is 1600 MHz / (POSTDIV1 * POSTDIV2) and eight
 * of those clocks make one back-to-back conversion.
 *
 * This replaced the CLKGEN6 divide ratios after run 9. Those were written,
 * read back and confirmed by DIVSWEN and CLKRDY at every single ratio, with
 * the generator switched off around the write and with it left running -
 * and the ADC converted at 40 MSPS throughout (docs/HARDWARE-LOG.md runs 8
 * and 9). The PLL's own output-divider switch is the one clock_init()
 * performs at boot, so it is known to work on this silicon.
 *
 * POSTDIV1 must not be smaller than POSTDIV2 (p778), and 7/7 = 32.65 MHz
 * is the slowest setting that still clears the ADC's 32 MHz minimum. */
static const struct pll_step sweep_steps[] = {
    { 7u, 7u },   /*  32.65 MHz   4.08 MSPS  slowest the ADC may run    */
    { 7u, 6u },   /*  38.10 MHz   4.76 MSPS                             */
    { 6u, 6u },   /*  44.44 MHz   5.56 MSPS                             */
    { 7u, 5u },   /*  45.71 MHz   5.71 MSPS                             */
    { 6u, 5u },   /*  53.33 MHz   6.67 MSPS                             */
    { 7u, 4u },   /*  57.14 MHz   7.14 MSPS                             */
    { 5u, 5u },   /*  64.00 MHz   8.00 MSPS  the customer's floor       */
    { 6u, 4u },   /*  66.67 MHz   8.33 MSPS                             */
    { 5u, 4u },   /*  80.00 MHz  10.00 MSPS                             */
    { 6u, 3u },   /*  88.89 MHz  11.11 MSPS                             */
    { 5u, 3u },   /* 106.67 MHz  13.33 MSPS                             */
    { 6u, 2u },   /* 133.33 MHz  16.67 MSPS                             */
    { 5u, 2u },   /* 160.00 MHz  20.00 MSPS                             */
    { 5u, 1u }    /* 320.00 MHz  40.00 MSPS  undivided, the boot setting */
};



uint32_t capture_set_clkdiv(uint32_t ratio_h)
{
    /* Kept for the record and for "clk": the CLKGEN6 divider does arrive
     * in the register but does not change the conversion rate on this
     * silicon (runs 8 and 9). The rate is set with capture_set_pll(). */
    const bool restart = capture_settle();      /* DMA down, burst ended */
    adc_deinit();                               /* core off              */
    const uint32_t rc    = clock_adc_set_div(ratio_h);
    const bool     ready = adc_reinit();        /* core on, ADRDY        */
    if (rc == CLKDIV_OK) { clkdiv_cur = ratio_h; }
    if (restart) { capture_start(); }           /* dma0_init() again     */
    if (rc != CLKDIV_OK) { return rc; }
    return ready ? CLKDIV_OK : CLKDIV_ADC;
}

uint32_t capture_set_pll(uint32_t p1, uint32_t p2)
{
    /* Same order as the divider and as the boot: DMA channel down and
     * burst finished, ADC core off (the PLL's output dividers must not
     * move while something runs off them, p778), PLL retuned, core on
     * with ADRDY, DMA set up from scratch on the next start. */
    const bool restart = capture_settle();
    adc_deinit();
    const uint32_t rc    = clock_adc_set_pll(p1, p2);
    const bool     ready = adc_reinit();
    if (restart) { capture_start(); }
    if (rc != CLKDIV_OK) { return rc; }
    return ready ? CLKDIV_OK : CLKDIV_ADC;
}

