MicrochipTech/dspic33a-high-speed-adc-example/capture.c
uint32_t capture_clkdiv(void)        { return clock_adc_div(); }  /* hardware */
uint32_t capture_clkdiv_wanted(void) { return clkdiv_cur; }       /* asked for */

uint32_t capture_nominal_ksps(uint32_t ratio_h)
{
    (void)ratio_h;
    /* Eight ADC clocks per back-to-back conversion, and the clock is read
     * from the registers - so this is the rate the hardware is actually
     * set up for, not the one that was asked for. */
    return clock_adc_hz() / 8000u;
}

const struct pll_step *capture_sweep_steps(uint32_t *count)
{
    *count = sizeof sweep_steps / sizeof sweep_steps[0];
    return sweep_steps;
}


const volatile uint16_t *capture_completed_half(void)
{
    return &buf[ready_half ? half_len : 0u];
}

void counters_clear(void)
{
    overrun_abort = false;            /* re-arm the brake               */
    overrun_run   = 0;
    isr_entries = 0; half_events = 0; done_events = 0; burst_starts = 0;
    proc_ticks_max = 0; proc_ticks_sum = 0; proc_count = 0;
    dma_overrun = 0; dma_addr_err = 0; dma_bus_err = 0;
    late_service = 0; proc_missed = 0;
    /* Halves completed up to now are not "missed" from here on. Without
     * this the first capture_service() after the self-test books its
     * 12 unserviced halves as proc_missed, and the heartbeat goes to the
     * error rate before the measurement has even started. */
    seen_blocks = blocks_done;
}

/* ------------------------------------------------------------------ *
 * Process one completed buffer half
 *
 * Placeholder for the customer's "+ and -" arithmetic. Written as a
 * plain accumulate so the cost of touching every sample is visible in
 * the measurement: at 40 MSPS this loop sees 40 million values per
 * second and per channel, and whether the CPU keeps up is as much a
 * question as the DMA bandwidth.
 * ------------------------------------------------------------------ */
static void process_buffer(const volatile uint16_t *b, uint32_t n)
{
    int32_t acc = 0;
    for (uint32_t i = 0; i < n; i++) {
        acc += (int32_t)b[i];
    }
    proc_result = acc;
    SIM_CHECK_HALF(b, n);             /* simulator: is this really the next half? */
}

static uint32_t half_mean(const volatile uint16_t *b, uint32_t n)
{
    uint32_t acc = 0;
    for (uint32_t i = 0; i < n; i++) {
        acc += b[i];
    }
    return acc / n;
}

bool capture_service(void)
{
    const uint32_t done = blocks_done;
    if (done == seen_blocks) {
        return false;
    }
    if ((done - seen_blocks) > 1u) {
        proc_missed += (done - seen_blocks) - 1u;
    }
    seen_blocks = done;
    const uint32_t t0 = timebase_ticks();
    process_buffer(capture_completed_half(), half_len);
    const uint32_t dt = timebase_ticks() - t0;
    if (dt > proc_ticks_max) { proc_ticks_max = dt; }
    proc_ticks_sum += dt;
    proc_count++;
    guard_check();                    /* did the DMA stay inside buf?    */

    /* Heartbeat: slow while clean, fast once any error counter moved. */
    if (led_get_mode() == 2u) {
        const bool clean = (dma_overrun | dma_addr_err | dma_bus_err |
                            late_service | proc_missed) == 0u;
        if ((done % (clean ? HEARTBEAT_OK : HEARTBEAT_ERR)) == 0u) {
            led_toggle();
        }
    }
    return true;
}

/* Wait until blocks_done passes a value. Returns 0, or 6 (nothing
 * moves) or 8 (the DMA switched itself off, e.g. on an address fault). */
static uint32_t wait_for_blocks(uint32_t target)
{
    uint32_t n = WAIT_LIMIT;
    while (blocks_done < target) {
        SIM_DMA_TICK();               /* simulator: deliver a half     */
        if (!dma0_enabled()) { return 8u; }
        if (--n == 0u)       { return 6u; }
    }
    guard_check();
    return 0u;
}

uint32_t capture_selftest(uint32_t *mean)
{
    const uint8_t  keep_pinsel = adc_pinsel();
    const uint8_t  keep_samc   = adc_samc();
    const bool     was_running = capture_settle();   /* defined start   */
    uint32_t       rc;

    (void)capture_set_input(SELFTEST_PINSEL, SELFTEST_SAMC);
    capture_start();

    /* The switch takes effect at the next DONE, then a full burst runs
     * on the new input: wait long enough that the half we judge is the
     * reference and nothing else. */
    rc = wait_for_blocks(blocks_done + SELFTEST_HALVES);
    if (rc == 0u) {
        const uint32_t m = half_mean(capture_completed_half(), half_len);
        selftest_mean = m;
        if (mean != NULL) { *mean = m; }
        if ((m < SELFTEST_MIN) || (m > SELFTEST_MAX)) { rc = 7u; }
    }

    if (rc == 0u) {
        console_kv("[selftest] mean on internal 15/16 VDD (expect ~3840)", selftest_mean);
    } else if (rc == 6u) {
        console_puts("[selftest] no DMA blocks arrived\r\n");
    } else if (rc == 7u) {
        console_kv("[selftest] mean outside 3648..4032", selftest_mean);
    } else {
        console_puts("[selftest] DMA channel disabled\r\n");
    }

    (void)capture_set_input(keep_pinsel, keep_samc);
    if (rc == 0u) {
        rc = wait_for_blocks(blocks_done + SELFTEST_HALVES);   /* settle */
    }
    if (!was_running) {
        capture_stop();
    }
    return rc;
}

/* ------------------------------------------------------------------ *
 * Delivered rate
 *
 * Timer1 (timebase.c) is only the stopwatch; the ADC clock produces the
 * rate. Measuring it is one thing and one thing only now: run `halves`
 * halves at whatever the divider is set to and divide the sample count
 * by the elapsed time. The judgement - does this rate match the ratio,
 * and did anything get lost - belongs to the caller, which prints it.
 * ------------------------------------------------------------------ */
uint32_t capture_clkoff_probe(uint32_t halves)
{
#ifdef __MPLAB_DEBUGGER_SIMULATOR
    (void)halves;
    return 6u;
#else
    /* The control experiment for the question runs 8 and 9 raised: is the
     * ADC really clocked from CLKGEN6? Table 16-1 says it is, and yet the
     * generator's divider has no effect on the conversion rate. So take
     * the core down, switch the generator OFF, bring the core back and
     * try to convert.
     *
     * Returns 0 if halves still arrive - which would mean the ADC is not
     * running off CLKGEN6 at all and explains everything at a stroke - or
     * 6/8 if nothing arrives, which is the expected, boring answer. The
     * generator and the core are restored either way. */
    (void)capture_settle();
    adc_deinit();
    clock_adc_off();
    const bool ready_off = adc_reinit();   /* does the core even come up? */
    counters_clear();
    const uint32_t target = blocks_done + halves;
    capture_start();
    const uint32_t rc = wait_for_blocks(target);
    (void)capture_settle();

    adc_deinit();                          /* restore, in the boot order  */
    (void)clock_adc_on();
    (void)adc_reinit();
    console_kv("[clkoff]   ADC core reported ready with the generator off", ready_off ? 1u : 0u);
    return rc;
#endif
}

/* ------------------------------------------------------------------ *
 * The variant matrix (capture.h)
 * ------------------------------------------------------------------ */
static capture_variant_t var_cur      = CAP_VAR_B2B;
static uint32_t          var_ksps     = 0u;   /* what it should deliver */
static uint32_t          var_trig_ns  = 0u;   /* 0 = untriggered        */

const char *capture_variant_name(capture_variant_t v)
{
    switch (v) {
    case CAP_VAR_B2B:         return "back-to-back, rate from PLL1";
    case CAP_VAR_SCCP_T_PER:  return "SCCP1 timer + special event, peripheral clock";
    case CAP_VAR_SCCP_T_G13:  return "SCCP1 timer + special event, CLKGEN13";
    case CAP_VAR_SCCP_OC_PER: return "SCCP1 output compare, peripheral clock";
    case CAP_VAR_SCCP_OC_G13: return "SCCP1 output compare, CLKGEN13";
    case CAP_VAR_SCCP_OLD:    return "SCCP1 as in runs 5-7 (trigger 34, rollover)";
    case CAP_VAR_SCCP_TRG2:   return "SCCP1 special event as TRG2 inside a burst";
    case CAP_VAR_RPTCNT:      return "ADC repeat timer (RPTCNT)";
    case CAP_VAR_OVERSAMPLE:  return "oversampling, ACCNUM divides the event rate";
    case CAP_VAR_CLKDIV:      return "CLKGEN6 divider";
    default:                  return "?";
    }
}

uint32_t capture_variant_ksps(void)      { return var_ksps; }
uint32_t capture_trigger_period_ns(void) { return var_trig_ns; }

/* The PLL pair whose rate is closest to the wish, from the sweep ladder. */
static struct pll_step pll_for(uint32_t want_ksps, uint32_t *got_ksps)
{
    uint32_t n = 0u;
    const struct pll_step *st = capture_sweep_steps(&n);
    struct pll_step best = st[0];
    uint32_t best_d = 0xFFFFFFFFu, best_k = 0u;
    for (uint32_t i = 0; i < n; i++) {
        const uint32_t k = (uint32_t)(1600000u / ((uint32_t)st[i].p1 * st[i].p2) / 8u);
        const uint32_t d = (k > want_ksps) ? (k - want_ksps) : (want_ksps - k);
        if (d < best_d) { best_d = d; best = st[i]; best_k = k; }
    }
    if (got_ksps != NULL) { *got_ksps = best_k; }
    return best;
}

bool capture_select_variant(capture_variant_t v, uint32_t want_ksps)
{
    if ((v >= CAP_VAR_COUNT) || (want_ksps == 0u)) { return false; }

    (void)capture_settle();           /* idle before anything changes   */
    sccp1_stop();
    var_cur     = v;
    var_ksps    = 0u;
    var_trig_ns = 0u;

    /* Every variant starts from the same base: the ADC clock undivided
     * and at full speed, so that only the variant's own mechanism can
     * account for a rate below it. The PLL variant overrides this. */
    if (v != CAP_VAR_B2B) {
        adc_deinit();
        (void)clock_adc_set_div(100u);
        (void)clock_adc_set_pll(5u, 1u);   /* 320 MHz                   */
        (void)adc_reinit();
    }

