MicrochipTech/dspic33a-high-speed-adc-example/capture.c
    switch (v) {
    case CAP_VAR_B2B: {
        uint32_t got = 0u;
        const struct pll_step st = pll_for(want_ksps, &got);
        adc_deinit();
        if (clock_adc_set_pll(st.p1, st.p2) != CLKDIV_OK) { (void)adc_reinit(); return false; }
        if (!adc_reinit()) { return false; }
        adc_set_mode_burst();
        var_ksps = got;
        break;
    }

    case CAP_VAR_SCCP_T_PER:
    case CAP_VAR_SCCP_T_G13:
    case CAP_VAR_SCCP_OC_PER:
    case CAP_VAR_SCCP_OC_G13:
    case CAP_VAR_SCCP_OLD:
    case CAP_VAR_SCCP_TRG2: {
        const bool        g13  = (v == CAP_VAR_SCCP_T_G13) || (v == CAP_VAR_SCCP_OC_G13) ||
                                 (v == CAP_VAR_SCCP_TRG2);
        const bool        oc   = (v == CAP_VAR_SCCP_OC_PER) || (v == CAP_VAR_SCCP_OC_G13);
        const bool        old  = (v == CAP_VAR_SCCP_OLD);
        const sccp_clk_t  clk  = g13 ? SCCP_CLK_GEN13 : SCCP_CLK_PERIPHERAL;
        const sccp_mode_t mode = oc  ? SCCP_MODE_OC   : SCCP_MODE_TIMER;
        const sccp_event_t ev  = old ? SCCP_EVENT_ROLLOVER : SCCP_EVENT_SPECIAL;
        const uint8_t     trg  = old ? SCCP3_ADC_TRIGGER : SCCP1_ADC_TRIGGER;

        if (g13 && !clock_trig_on()) { return false; }
        /* ticks of the module's own clock per sample */
        const uint32_t hz = g13 ? clock_trig_hz() : clock_periph_hz();
        const uint32_t ticks = hz / 1000u / want_ksps;
        if (ticks < 2u) { return false; }
        if (!sccp1_start(ticks, clk, mode, ev)) { return false; }

        if (v == CAP_VAR_SCCP_TRG2) {
            adc_set_mode_burst();     /* software starts, SCCP continues */
            adc_set_trg2(trg);
        } else {
            adc_set_mode_single(trg); /* one conversion per trigger      */
        }
        var_ksps    = sccp1_nominal_ksps();
        var_trig_ns = (uint32_t)(((uint64_t)ticks * 1000000000ull) / hz);
        break;
    }

    case CAP_VAR_RPTCNT: {
        /* TAD is a quarter of the ADC clock and a conversion is two TAD,
         * so the repeat timer's period in TAD gives 80000/n kSPS at
         * 320 MHz. 2..63. */
        uint32_t n = 80000u / want_ksps;
        if (n < 2u)  { n = 2u; }
        if (n > 63u) { n = 63u; }
        adc_set_mode_burst();
        adc_set_period((uint8_t)n);
        adc_set_trg2(0x03u);          /* repeat timer                    */
        var_ksps = 80000u / n;
        break;
    }

    case CAP_VAR_OVERSAMPLE: {
        /* ACCNUM is two bits. The event rate should be the conversion
         * rate divided by the accumulation count. */
        uint32_t acc = 0u;
        const uint32_t ratio = 40000u / want_ksps;
        if      (ratio >= 8u) { acc = 3u; }
        else if (ratio >= 4u) { acc = 2u; }
        else if (ratio >= 2u) { acc = 1u; }
        adc_set_mode_oversample((uint8_t)acc);
        var_ksps = 40000u >> acc;
        break;
    }

    case CAP_VAR_CLKDIV: {
        uint32_t ratio = 4000000u / want_ksps;
        if (ratio < 100u)  { ratio = 100u; }
        if (ratio > 1000u) { ratio = 1000u; }
        if ((ratio > 100u) && (ratio < 200u)) { ratio = 200u; }
        adc_deinit();
        const uint32_t rc = clock_adc_set_div(ratio);
        (void)adc_reinit();
        if (rc != CLKDIV_OK) { return false; }
        adc_set_mode_burst();
        var_ksps = 4000000u / ratio;
        break;
    }

    default:
        return false;
    }
    return true;
}

void capture_variant_regs(void)
{
    console_kv("[var]   adc MODE", adc_mode());
    console_kv("[var]   adc TRG1SRC", adc_trg1());
    console_kv("[var]   adc TRG2SRC", adc_trg2());
    console_kv("[var]   adc ACCNUM", adc_accnum());
    console_kv("[var]   adc RPTCNT", adc_period());
    console_kv("[var]   adc clock Hz", clock_adc_hz());
    console_kv("[var]   clkgen6 ratio x100", clock_adc_div());
    if (var_trig_ns != 0u) {
        console_kv("[var]   trigger period ns", var_trig_ns);
        sccp1_regs_dump();
    }
}

/* ------------------------------------------------------------------ *
 * The triggered stream - the chain the example is about (capture.h)
 *
 *   SCCP1 (CLKGEN13) -> ADC channel 0, Single Conversion, TRG1SRC 0x20
 *     -> "ADCn Done CH0" -> DMA0, Repeated One-Shot -> buf -> HALF/DONE
 *
 * Start order DMA, ADC, trigger last; stop order trigger first
 * (ANALYSIS.md C.10 point 4). The ADC is expected in Single mode already
 * (adc_set_mode_single(), done by the chain test once per core switch).
 * ------------------------------------------------------------------ */
bool capture_chain_start(uint32_t ticks, uint32_t sccp_mode,
                         uint32_t stop_after_done, bool src_data)
{
    (void)capture_settle();           /* idle, DMA down                  */
    counters_clear();
    chain_src_data = src_data;
    capture_init();                   /* DMA armed on RES or DATA        */
    adc_clear_events();
    chain_stop_after = stop_after_done;
    chain_t1     = 0u;
    chain_mode   = true;
    run_enabled  = true;
    burst_active = true;              /* "something runs" for the waits  */
    chain_t0 = timebase_ticks();
    if (!sccp1_start(ticks, SCCP_CLK_GEN13, (sccp_mode_t)sccp_mode, SCCP_EVENT_SPECIAL)) {
        (void)capture_settle();
        chain_src_data = false;
        return false;
    }
    return true;
}

bool capture_chain_active(void) { return chain_mode && run_enabled; }

uint32_t capture_chain_wait(uint32_t max_ticks)
{
    const uint32_t t0 = timebase_ticks();
    while (chain_mode && run_enabled) {
        if (!dma0_enabled())                     { return 8u; }
        if ((timebase_ticks() - t0) > max_ticks) { return 6u; }
    }
    return 0u;
}

uint64_t capture_transfers(void)
{
    /* Whole blocks plus the position in the current one. DMA0CNT counts
     * down and is reloaded at DONE, so right after a DONE the position is
     * 0 - and done_events has already been booked by the ISR, which runs
     * at priority 4, above every caller of this. */
    const uint32_t block = 2u * half_len;
    const uint32_t left  = dma0_remaining();
    const uint32_t pos   = (left <= block) ? (block - left) : 0u;
    return (uint64_t)done_events * block + pos;
}

uint64_t capture_chain_stop(void)
{
    sccp1_stop();                     /* trigger first                   */
    if (chain_t1 == 0u) { chain_t1 = timebase_ticks(); }
    /* The last conversion and its transfer: sample time plus conversion
     * plus one DMA transaction, well under a microsecond. Wait 2 us. */
    const uint32_t t = timebase_ticks();
    while ((timebase_ticks() - t) < 25u) { }
    const uint64_t n = capture_transfers();
    (void)capture_settle();
    chain_src_data = false;
    return n;
}

uint32_t capture_chain_window_ticks(void)
{
    return chain_t1 - chain_t0;
}

void capture_fill(uint16_t v)
{
    for (uint32_t i = 0; i < SAMPLES_PER_BUF_MAX; i++) { buf[i] = v; }
}

uint32_t capture_oneshot(void)
{
    return capture_oneshot_n(1u);
}

uint32_t capture_oneshot_n(uint32_t bursts)
{
    if (bursts == 0u) { bursts = 1u; }
    /* Fill the buffer exactly once and stop. The ADC burst is CNT =
     * 2 * half_len conversions, so one burst is one full buffer: HALF at
     * the middle, DONE at the end, and the ISR does not restart it. The
     * buffer then holds one contiguous window that nothing is writing
     * any more, which is the only way to look at the data at a rate
     * where the main loop cannot keep up (run 11). */
    (void)capture_settle();
    counters_clear();
    const uint32_t target = blocks_done + (2u * bursts);  /* HALF and DONE each */
    oneshot_left = bursts;
    capture_start();
    /* The clock starts HERE, not before capture_settle(): taking the DMA
     * channel down and setting it up again costs a fixed 11.3 us, and
     * with it inside the window every rate came out low - by 2.2 % at
     * 4 MSPS and 17.8 % at 40, purely because the same 11.3 us is a
     * different share of a shorter burst (run 14). Corrected, the
     * delivered rate matches the setting to better than 1 % everywhere. */
    const uint32_t t0 = timebase_ticks();
    const uint32_t rc = wait_for_blocks(target);
    oneshot_ticks = timebase_ticks() - t0;
    oneshot_left  = 0u;
    capture_stop();
    return rc;
}

