MicrochipTech/dspic33a-high-speed-adc-example/capture.c
uint32_t capture_oneshot_ticks(void)
{
    return oneshot_ticks;
}

const volatile uint16_t *capture_buffer(void)
{
    return &buf[0];
}

uint32_t capture_measure_rate(uint32_t halves, uint32_t *ksps)
{
#ifdef __MPLAB_DEBUGGER_SIMULATOR
    (void)halves;
    if (ksps != NULL) { *ksps = 0u; }
    return 0u;                        /* no ADC clock to measure        */
#else
    (void)capture_settle();           /* defined start                  */
    counters_clear();
    const uint32_t target = blocks_done + halves;
    const uint32_t t0     = timebase_ticks();
    capture_start();
    const uint32_t rc     = wait_for_blocks(target);
    const uint32_t ticks  = timebase_ticks() - t0;
    (void)capture_settle();           /* test over: DMA down            */
    if (rc != 0u) { return rc; }
    if (ksps != NULL) { *ksps = timebase_ksps(halves * half_len, ticks); }
    return 0u;
#endif
}

void capture_regs_dump(void)
{
    console_puts("[regs] counters\r\n");
    console_kv("blocks_done", blocks_done);
    console_kv("dma_overrun", dma_overrun);
    console_kv("late_service", late_service);
    console_kv("proc_missed", proc_missed);
    console_kv("dma_addr_err", dma_addr_err);
    console_kv("dma_bus_err", dma_bus_err);
    console_kv("selftest_mean", selftest_mean);
    /* The guard words behind the buffer: all must read 0xA5C3F00D + i. */
    console_kv_hex("buf", (uint32_t)buf);
    console_kv("half_len", half_len);
    console_kv_hex("buf_end (in use)", (uint32_t)&buf[2u * half_len]);
    console_kv_hex("guard0", dma_buffer.guard[0]);
    console_kv_hex("guard1", dma_buffer.guard[1]);
    console_kv_hex("guard15", dma_buffer.guard[BUF_GUARD_WORDS - 1u]);
}
